raibisch/ESP32_ABL/src/main.cpp

#include <Arduino.h>
#include "SPI.h"
#include "SPIFFS.h"
#include <WiFi.h>
#include "WiFiGeneric.h"
#include "math.h"
//#include <AsyncTCP.h>

#ifdef USE_ETH_INSTEAD_WIFI
#include <ETH.h>
#endif

#ifdef MQTT_ENABLE
#include <MQTT.h>
#endif

// set in platformio.ini !
//#define DEBUG_PRINT 1       
//#define DEBUG_WITHOUT_ABL 1 //calculate at "no com"

// ************************************
// 20.3.26 Erweiterung auf 2 Wallboxen
// set in platformio.ini !
// ************************************
//#define WB_COUNT 1
//#define WB_COUNT 2
// ************************************

#ifdef DEBUG_PRINT
#pragma message("Info : DEBUG_PRINT=1")
#define debug_begin(...) Serial.begin(__VA_ARGS__);
#define debug_print(...) Serial.print(__VA_ARGS__);
#define debug_write(...) Serial.write(__VA_ARGS__);
#define debug_println(...) Serial.println(__VA_ARGS__);
#define debug_printf(...) Serial.printf(__VA_ARGS__);
#else
#define debug_begin(...)
#define debug_print(...)
#define debug_printf(...)
#define debug_write(...)
#define debug_println(...)
#endif


#ifndef WITHOUT_TEMP
#include "driver/temp_sensor.h"
#endif


#include <ESPAsyncWebServer.h>
#include "ESP32Time.h"

// for EEPROM Emulation
#include <Preferences.h>

#include "FileVarStore.h"
#include "AsyncWebLog.h"
#include "AsyncWebOTA.h"

#ifdef DEF_S2_MINI
#pragma message(": Info for CuteCom: Set DTR for Serial-communication")
#endif

#define ABL_ENABLE_TX HIGH
#define ABL_ENABLE_RX LOW

/*
Set I-Soll:
===========
all values are hardcoded with Checksum !

6A:
:01100014000102006474

7A:
:01100014000102007563

8A:
:01100014000102008553

9A:
:01100014000102009642

10A:
:0110001400010200A731

11A:
:0110001400010200B721

12A:
:0110001400010200C810

13A:
0110001400010200D9FF

14A:
:0110001400010200E9EF

15A:
:0110001400010200FADE

16A:
:01100014000102010BCC

DISABLE:
:0110001400010203E8ED

*/

HardwareSerial Serial_ABL(1);

ESP32Time rtc[] = {0,0};

//ESP32Time rtc1(0); 
//ESP32Time rtc2(0); 

AsyncWebServer server(80);
#ifdef MQTT_ENABLE
WiFiClient client;
#endif
const char* PARAM_MESSAGE = "message";
bool bInitFileOK = false;


enum ABL_POLL_STATUS {
  POLL_Current,      // implemented and tested
  SET_Current,       // implemented and tested
  SET_StopCharge,    // implemented and tested (ABL_TX_SET_DISABLE)
  SET_RestartCharge, // implemented and tested (SET_CURRENT after SET_CURRENT x3E8)
  SET_DISABLE_WB,    // todo... not implemented
  SET_ENABLE_WB,     // todo... not implemented
  POLL_FIRMWARE      // todo... not implemented
};

// !! same nummer of elements as ABL_STATUS_STRING !!
enum ABL_STATUS { 
ABL_A1=0,     // not connected,  Waiting for EV 
ABL_B1,       // connected, EV is asking for charging
ABL_B2,       // connected, EV hat the permission to charge (=charge finished)
ABL_C2,       // connected, EV in charging 
ABL_C3,       // connected, EV in charging reduced current
ABL_C4,       // connected, EV in charging reduced current
ABL_UNVALID,  // 
ABL_TIMEOUT,  // no Rx after 2x Polltimes
ABL_PAUSE     // Pause
};

const String ABL_STATUS_STRING[] = {  
"A1",     // not connected,  Waiting for EV 
"B1",     // connected, EV is asking for charging
"B2",     // connected, EV hat the permission to charge
"C2",     // connected, EV in charging 
"C3",     // connected, EV in charging reduced current
"C4",     // connected, EV in charging reduced current
"??",     // unvalid
"nocom",  // timeout or no connection
"pause "   // Pause
};


// Index für ABL_TX_MSG
enum ABL_TX_MSG_INDEX
{
  TX_POLL=0,
  TX_SET_6A,
  TX_SET_7A,
  TX_SET_8A,
  TX_SET_9A,
  TX_SET_10A,
  TX_SET_11A,
  TX_SET_12A,
  TX_SET_13A,
  TX_SET_14A,
  TX_SET_15A,
  TX_SET_16A,
  TX_SET_DISABLE,
  TX_index_count
};

/*
LRC-Berechnung
==============
Online Calculater:  http://www.metools.info/encoding/ecod127.html

Bei allen Befehlen muss das abschließende LRC Byte hinzugefügt werden.
Dazu muss man dort die Option Hex auswählen und dann den Befehl ohne Doppelpunkt z.B. 
aus der Abfrage der Firmware, hier also 010300010002 einfügen.
Dann erhält man unter Calculation result (Hex) den gewünschten Wert. Diese hängt man an den Befehl.
Hier also :010300010002+F9 also :010300010002F9
*/

const char* ABL_TX_MSG[] = {
 // Bus-Nr 01
 ":0103002E0005C9",          // POLL
 ":01100014000102006474",    // SET_6A
 ":01100014000102007563",    // SET_7A
 ":01100014000102008553",    // SET_8A
 ":01100014000102009642",    // SET_9A
 ":0110001400010200A632",    // SET_10A 
 ":0110001400010200B721",    // SET_11A                        
 ":0110001400010200C810",    // SET_12A
 ":0110001400010200D9FF",    // SET_13A
 ":0110001400010200E9EF",    // SET_14A
 ":0110001400010200FADE",    // SET_15A
 ":01100014000102010BCC",    // SET_16A
 ":0110001400010203E8ED",    // SET_DISABLE
 // Bus-Nr 02
 ":0203002E0005C8",          // POLL
 ":02100014000102006473",    // SET_6A
 ":02100014000102007562",    // SET_7A
 ":02100014000102008552",    // SET_8A
 ":02100014000102009641",    // SET_9A
 ":0210001400010200A631",    // SET_10A  
 ":0210001400010200B720",    // SET_11A                       
 ":0210001400010200C80F",    // SET_12A
 ":0210001400010200D9FE",    // SET_13A
 ":0210001400010200E9EE",    // SET_14A
 ":0210001400010200FADD",    // SET_15A
 ":02100014000102010BCB",    // SET_16A
 ":0210001400010203E8EC"     // SET_DISABLE
};

/*
not extra handeled but displayed status messages (from ABL docu):
=================================================================
E0 Outlet disabled
E1 Production test
E2 EVCC setup mode
E3 Bus idle
F1 Unintended closed contact (Welding)
F2 Internal error
F3 DC residual current detected
F4 Upstream communication timeout
F5 Lock of socket failed
F6 CS out of range
F7 State D requested by EV
F8 CP out of range
F9 Overcurrent detected
F10 Temperature outside limits
F11 Unintended opened contactd

dump:

TX:0103002E0005C9
Next Polling in :28sec
RX>01030A2EC2910B03E803E803E8A5

Status:C2 Ipwm:0B I1:03E8 I2:03E8 I3:03E8
Status:C2 Ipwm:0B I1:03E8 I2:03E8 I3:03E8
Ipwm=0.00 I=0.00+0.00+0.00+ Isum=0.00

Ipwm=0.00 I=0.00+0.00+0.00+ Isum=0.00

Next Polling in :26sec

*/




