raibisch/ESP32_ABL/src/main.cpp
}
#endif // MQTT
         

/// @brief ABL Rx-Timeout after 2 polling periodes
bool inline testTimeount(uint_fast16_t wb_ix)
{
        ABL_rx_timeoutcount[wb_ix]++;

// DEBUG: Simulate status
// !!! only for index "0"
#ifdef DEBUG_WITHOUT_ABL
#define SIMULATE_WB_IX 1
#pragma message("Info : DEBUG_WITHOUT_ABL=1")
        
        if (ABL_PauseFlag[SIMULATE_WB_IX] && ABL_rx_status[SIMULATE_WB_IX].startsWith("C"))
        {
          ABL_rx_status[SIMULATE_WB_IX] = "B2";
        }
        //ABL_rx_Ipwm = 16;
        ABL_rx_Ipwm[SIMULATE_WB_IX] = 6;
        debug_printf("ABL_rx_timeoutcount:%d\r\n", ABL_rx_timeoutcount);

        AsyncWebLog.print("ABL_rx_timeoutcount:");
        AsyncWebLog.println(String(ABL_rx_timeoutcount[SIMULATE_WB_IX]));
        
        if (ABL_rx_timeoutcount[SIMULATE_WB_IX] < 1)
        {
          ABL_rx_status[SIMULATE_WB_IX] = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if (ABL_rx_timeoutcount[SIMULATE_WB_IX] < 3)
        {
          ABL_rx_status[SIMULATE_WB_IX] = ABL_STATUS_STRING[ABL_C2];
        }
        /*
        else
        if (ABL_rx_timeoutcount[0] < 4)
        {
          ABL_rx_status[0] = "?";
        } 
        */
        else
        if (ABL_rx_timeoutcount[SIMULATE_WB_IX] < 8)
        {
          ABL_rx_status[SIMULATE_WB_IX] = ABL_STATUS_STRING[ABL_C2];
        } 
        else
        if (ABL_rx_timeoutcount[SIMULATE_WB_IX] < 9)
        {
          ABL_rx_status[SIMULATE_WB_IX] = ABL_STATUS_STRING[ABL_B2];
        }
        /*
        else
        if (ABL_rx_timeoutcount[0] < 10)
        {
          ABL_rx_status[0] = "?";
        }
        else
        if(ABL_rx_timeoutcount[0] < 11)
        {
          ABL_rx_status[0] = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if(ABL_rx_timeoutcount[0] < 12)
        {
          ABL_rx_status[0] = "F1"; // simulate Error Message
        }
        */
        else
        {
          ABL_rx_timeoutcount[SIMULATE_WB_IX] = 0;
          ABL_rx_status[SIMULATE_WB_IX] = ABL_STATUS_STRING[ABL_B2];
        }
        return false;
#else
        if (ABL_rx_timeoutcount[wb_ix] > 3)
        {
          ABL_rx_status[wb_ix] = ABL_STATUS_STRING[ABL_TIMEOUT];
          ABL_rx_Ipwm[wb_ix] = 0;
          return true;
        }
        return false;
#endif
}

// ---- EEPROM Simulation to save Values over Reset and Poweroff-------
Preferences hist;


void inline initHistory()
{
   hist.begin("history", false); // use history
   ABL_Wh_Sum_old[0] = hist.getULong64("whsum",0);
   ABL_Wh_Sum_akt[0] = ABL_Wh_Sum_old[0];
   ABL_Wh_Sum_old[1] = hist.getULong64("whsum02",0);
   ABL_Wh_Sum_akt[1] = ABL_Wh_Sum_old[1];

   debug_printf("restored ABL_Wh_Sum_old WB1= %d\r\n",ABL_Wh_Sum_old[0]);
   debug_printf("restored ABL_Wh_Sum_old WB2= %d\r\n",ABL_Wh_Sum_old[1]);
   //SYS_RestartCount = hist.getInt("restart",0);
   //SYS_TimeoutCount = hist.getInt("timeout",0);
   SYS_ChargeCount[0] =  hist.getInt("charge",0);
   SYS_ChargeCount[1] =  hist.getInt("charge2,0");
   debug_printf("restored charge count 1= %d\r\n",SYS_ChargeCount[0]);
   debug_printf("restored charge count 2= %d\r\n",SYS_ChargeCount[1]);
}

bool set_Wh_Sum(uint_fast16_t wb_ix, unsigned long whs)
{
  if (wb_ix ==0)
  {
   hist.putULong64("whsum", whs);
  }
  else
  {
   hist.putLong64("whsum02", whs);
  }

  return true;
}


bool saveHistory()
{
   ABL_Wh_Sum_old[0] = ABL_Wh_Sum_akt[0];
   ABL_Wh_Sum_old[1] = ABL_Wh_Sum_akt[1];
   debug_printf("ABL_Wh_Sum_akt01:%d\r\n",ABL_Wh_Sum_akt[0])
   debug_printf("ABL_Wh_Sum_akt02:%d\r\n",ABL_Wh_Sum_akt[1])
   hist.putULong64("whsum",ABL_Wh_Sum_akt[0]);
   hist.putULong64("whsum02",ABL_Wh_Sum_akt[1]);
   //hist.putUInt("restart", SYS_RestartCount);
   //hist.putUInt("timeout", SYS_TimeoutCount);
   return true;
}
// ----  END EPROM Simulation -----------------------------------------

//////////////////////////////////////////////////////////
static double Wh = 0;
/// @brief calculate aktual an total (sum) of W/h
/// @param polltime_ms 
/// @return 
/////////////////////////////////////////////////////////
void calculate_kWh(uint_fast16_t wb_ix)
{
   String sPrint;
   sPrint.reserve(100);
   sPrint = "[Calc__]WB";
   sPrint += wb_ix+1;
   sPrint += " rx_status:";
   sPrint += ABL_rx_status[wb_ix];
    if (ABL_PauseFlag[wb_ix])
   {
    sPrint += " pause";
   }
  
   AsyncWebLog.println(sPrint);
   if (ABL_rx_status[wb_ix].startsWith("?")) // no calulation at unvalid data
   {
    return;
   }

   if (ABL_rx_status[wb_ix].startsWith("no")) // no calulation at timeout
   {
    return;
   }


   if (ABL_rx_status_old[wb_ix] != ABL_rx_status[wb_ix]) // Status is changing
   {
    // end charging
    if (ABL_rx_status_old[wb_ix].startsWith("C"))
    {
      saveHistory();
      hist.putInt("charge",(SYS_ChargeCount[wb_ix])++);
    }
    else
    // start charging
    if (ABL_rx_status[wb_ix].startsWith("C"))
    {
      saveHistory();
      rtc[wb_ix].setTime(1);
      forcePolling();
      ABL_rx_Isum[wb_ix] = 0;
      ABL_rx_kW[wb_ix]   = 0;
    }
    else
    if (ABL_rx_status[wb_ix].startsWith("A"))
    {
      saveHistory();
      ABL_rx_Isum[wb_ix] = 0;
      ABL_rx_kW[wb_ix]   = 0;
      ABL_rx_Wh[wb_ix]   = 0;
      ABL_sChargeTime[wb_ix] = "00:00:00";
    }
    else
     // End of Charging  by JG 24.3.2024 set kw=0 at
    if (ABL_rx_status[wb_ix].startsWith("B"))
    {
      ABL_rx_kW[wb_ix] = 0;
      ABL_rx_Isum[wb_ix] = 0;
    }

    ABL_rx_status_old[wb_ix] = ABL_rx_status[wb_ix];
   } // End Status is changing

  
   if (ABL_rx_status[wb_ix].startsWith("C") && ABL_PauseFlag[wb_ix]==false) // is charging
   {
      //Serial.printf("WBx:%d status:%s Isum:%2.2f, Ipwm:%d", wb_ix, ABL_rx_status[wb_ix].c_str(), ABL_rx_Isum[wb_ix], ABL_rx_Ipwm[wb_ix]);
      if ( ABL_rx_Isum[wb_ix] == 0) // virtual I-values: calculation with Watt Values from config-values
      {
           switch (ABL_rx_Ipwm[wb_ix])
           { 
            case 6:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_06A / 1000.0;
             break; 
            case 7:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_07A / 1000.0;
             break;
            case 8:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_08A / 1000.0;
             break; 
            case 9:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_09A / 1000.0;
             break;
            case 10: 
             ABL_rx_kW[wb_ix]= varStore.varABL_i_Watt_10A / 1000.0;
             break;  
            case 11: 
             ABL_rx_kW[wb_ix]= varStore.varABL_i_Watt_11A / 1000.0;
             break; 
            case 12:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_12A / 1000.0;
             break;
            case 13:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_13A / 1000.0;
             break;
            case 14:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_14A / 1000.0;
             break;
            case 15:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_15A / 1000.0;
             break;
            case 16:
             ABL_rx_kW[wb_ix] = varStore.varABL_i_Watt_16A / 1000.0;
             break;
            default: // use standard for all other values ... or... expand your code ;-)
             ABL_rx_kW[wb_ix] = (230*2*ABL_rx_Ipwm[wb_ix]) / 1000.0;
             break;
           }
           //Serial.printf(" ABL_rx_kw: %2.2f\r\n", ABL_rx_kW[wb_ix]);
      }
      else // real I-values from ABL
      { 
          ABL_rx_kW[wb_ix] = uint32_t(ABL_rx_Isum[wb_ix]*varStore.varABL_i_U_netz) / 1000.0;
      }
      
      ABL_sChargeTime[wb_ix] = rtc[wb_ix].getTime();
      Wh = (ABL_rx_kW[wb_ix] * (rtc[wb_ix].getEpoch()*1000)) / (double)3600.0;
      
      ABL_rx_Wh[wb_ix] = round(Wh);  
      debug_printf("W/h:%d\r\n", ABL_rx_Wh);
      ABL_Wh_Sum_akt[wb_ix] = ABL_Wh_Sum_old[wb_ix] + ABL_rx_Wh[wb_ix];

      sPrint= "[Calc_C]WB"+ String(wb_ix+1) + " "+ ABL_sChargeTime[wb_ix] + " Wh-akt:" + ABL_rx_Wh[wb_ix]+ " Wh-Sum:" + ABL_Wh_Sum_akt[wb_ix] ;
      AsyncWebLog.println(sPrint);
  }
  else
  {
   ABL_rx_kW[wb_ix] = 0;
   if (ABL_PauseFlag[wb_ix])
   {
        ABL_rx_Isum[wb_ix] = 0;
   } 
  } 

    
