raibisch/ESP32_ABL/src/main.cpp
}

// 13.5.26 new: Load-Balance for 2 Wallboxes


/// @brief Set Imax with Load-Balance Limits and Modes
/// @param wb_ix 
/// @param icmax 
void setIcmax(uint_fast16_t wb_ix, uint16_t icmax)
{
  uint16_t imaxOther = 0;
  ABL_tx_Icmax[wb_ix] = icmax;
   
  if (varStore.varABL_i_LoadBal_Mode == 0)
  {
    for (size_t i = 0; i < WB_COUNT; i++)
    {
     //debug_printf("[LoadBal 0] calc1 WB0%d Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[i]);
     if (i != wb_ix)
     {
       imaxOther += ABL_tx_Icmax[i];
       debug_printf("[LoadBal 0] calc2 WB0%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);
     }
    }
    debug_printf("[LoadBal 0] set WB0%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);

    if (icmax > (varStore.varABL_i_LoadBal_Imax - imaxOther))
    {
      // Möglichkeit A: Rest ist nur noch verfügbar
      //ABL_tx_Icmax[wb_ix] = varStore.varABL_i_LoadBal_Imax - imaxFree;
      
      // Möglichkeit B: 50% Aufteilung --> z.Z. realisiert !
      for (size_t i = 0; i < WB_COUNT; i++)
      {
        ABL_tx_Icmax[i] = varStore.varABL_i_LoadBal_Imax / 2;
      }
      
      debug_printf("[LoadBal 0] L I M I T ! WB0%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]);
      AsyncWebLog.println("[LoadBal] Mode=0 LIMIT! Icmax!");
    }
    else
    {
      debug_printf("[LoadBal Mode:0] no limit WB0%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]); 
    }
  }
  else if (icmax > 0)
  {
   // Prio WB1
   if ((varStore.varABL_i_LoadBal_Mode == 1) && (wb_ix == 0))
   {
     ABL_tx_Icmax[1]  = 0;
     ABL_PauseFlag[1] = true;
     debug_printf("[LoadBal Mode:1] Prio WB01\r\n");
   }
   else
   // Prio WB2
   if ((varStore.varABL_i_LoadBal_Mode == 2) && (wb_ix == 1))
   {
     ABL_tx_Icmax[0]  = 0;
     ABL_PauseFlag[0] = true;
     debug_printf("[LoadBal Mode:2] Prio WB02\r\n");
   }
 }

 forcePolling();
}


uint16_t getIcmax(uint_fast16_t wb_ix)
{
  if ((ABL_tx_Icmax[0] + ABL_tx_Icmax[1]) > varStore.varABL_i_LoadBal_Imax)
  {
    return 8;
  }
  if (ABL_tx_Icmax[wb_ix] > varStore.varABL_i_LoadBal_Imax)
  {
    return varStore.varABL_i_LoadBal_Imax;
  }
  
  return ABL_tx_Icmax[wb_ix];
}


/// @brief Init ABL communication over RS485
void inline ABL_init()
{
    debug_printf("ABL_init: parameters: ABL_RXD_GPIO=%d, ABL_TXT_GPIO=%d, ABL_RX_LOW_ENABLE_GPIO=%d\r\n", ABL_RXD_GPIO, ABL_TXT_GPIO, ABL_RX_LOW_ENABLE_GPIO);
    debug_println("ABL_init: start to initialize...");
    Serial_ABL.begin(38400, SERIAL_8E1, ABL_RXD_GPIO, ABL_TXT_GPIO);
    ABL_rx_String="";
    //ABL_rx_String.reserve(200);
    pinMode(ABL_RX_LOW_ENABLE_GPIO, OUTPUT_OPEN_DRAIN);
    digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0);
    delay(1);
    //Serial_ABL.flush();
    debug_println("ABL_init: check serial connection...");
    while(Serial_ABL.available())
    {
        Serial_ABL.read();
    }
    forcePolling();
    ABL_PollTime_old  = 0;
    ABL_StatusSec_old = 0;
    debug_println("ABL_init: OK!");
}

/// @brief Send to ABL
/// @param s 
void ABL_Send(uint8_t wb_ix,  ABL_POLL_STATUS s)
{
 String tx = "";

 uint_fast16_t msg_ix_offset = wb_ix* ABL_TX_MSG_INDEX::TX_index_count;

 switch (s)
 {
  case POLL_Current:
    tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_POLL + msg_ix_offset]);
  break;

  case SET_Current:
    ABL_PauseFlag[wb_ix] = false;
    switch (ABL_tx_Icmax[wb_ix])
    {
      case 0:
        ABL_PauseFlag[wb_ix] = true;
        tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_DISABLE + msg_ix_offset]);
      break;
   
      case 6:
       tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_6A + msg_ix_offset]);
      break;

      case 7:
        tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_7A + msg_ix_offset]);
      break;

      case 8:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_8A + msg_ix_offset]);
      break;

      case 9:
           tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_9A + msg_ix_offset]);
      break;

      case 10:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_10A + msg_ix_offset]);
      break;
         
      case 11:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_11A + msg_ix_offset]);
      break;

      case 12:
           tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_12A + msg_ix_offset]);
      break;

      case 13:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_13A + msg_ix_offset]);
      break;

      case 14:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_14A + msg_ix_offset]);
      break;

      case 15:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_15A + msg_ix_offset]);
      break;

      case 16:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_16A + msg_ix_offset]);
      break;

      default:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_6A + msg_ix_offset]);
      break;
    }
  break; // End Set_Current

  //todo: additional Tx-Commands
  // 
  // ModifyState: Register 0x05
  // Enable:  A1A1
  // Disable: E0E0 
  
  // GetFirmware: Register 0x01
  
  default:
  break;
 } // end of swtich(s) --> ABL_POLL_STATUS

 AsyncWebLog.println("Tx" + tx);
 debug_printf("TX:%s\r\n",tx.c_str());
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1);
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // Switch from TX to RX
 delay(1000);
 // empty the first rx input because of possible trash after first ABL-wakeup call
 while (Serial_ABL.available()) 
 {
    // cppcheck-suppress unreadVariable
    char inChar = (char)Serial_ABL.read();
 }
 // send 2x for wakeup from sleep
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1); // Switch form Rx to TX
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);

 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // switch from Tx to Rx
}

 /// @brief Parse the received Data from ABL
 /// @param s 
 bool ABL_ParseReceive(String s)
 {
/*
Register 0x002E Read current (full)
   r/w Reg leng, LRC
   r  46d   5
:01 03 002E 0005 C9   

Send: 
:0103002E0005C9
Answer: (Status A1 = not connected)
>01030A2EA1108503E803E803E8CD


