raibisch/ESP32_ABL/src/main.cpp
                      0=not connected
                      0=not reduced
                      0=EN2 open
                      1=EN1 closes 
      Cnt Reg    State   0001       Imax       Ip1  Ip2  Ip3  LRC
      10                         133dx0.06
                                 = 8A
>01 03 0A 2E      A1     10        85          03E8 03E8 03E8 CD
cnt:               0      1         2          3 4  5 6  7 8 
>01 03 0A 2E      A1     10        64          03E8 03E8 03E8 EE
                                 100dx0.06
                                 =  6A
*/
  bool ret = false;
  uint_fast16_t wb_ix = 0;
  if (s.startsWith("01",1))
  {
     wb_ix = 0;
     //debug_println("RX01");
  }
  if (s.startsWith("02",1))
  {
    wb_ix = 1;
    //debug_println("Rx02");
  }

  if         (s.indexOf("03A02E") && s.length()>=28)
  //if (s.startsWith(">01030A2E") && s.length()>=28 )  // 2E = Read current (full)
  {
       AsyncWebLog.println("Status:" + s.substring(9,11)+ " Ipwm:" + s.substring(13,15) + " I1:" + s.substring(15,19) +  + " I2:" + s.substring(19,23) + " I3:" + s.substring(23,27));  
       ABL_rx_status[wb_ix] = s.substring(9,11);
       try
       {
         ABL_rx_Ipwm[wb_ix] = (uint16_t)(round(HexString2int(s.substring(12,15)) * (float)0.06));
         uint32_t i1,i2,i3 =0;
        
         i1 = HexString2int(s.substring(15,19));
         if (i1 > 900)
         {i1=0;}

         i2 = HexString2int(s.substring(19,23));
         if (i2 > 900)
         {i2=0;}

         i3 = HexString2int(s.substring(23,27));
         if (i3 > 900)
         {i3=0;}
         
         ABL_rx_Isum[wb_ix] = (i1 +i2 + i3) / 10;

         AsyncWebLog.println("Ipwm="+ String(ABL_rx_Ipwm[wb_ix])+  " I="+ String(i1/10.0)+ "+" + String(i2/10.0) +"+" +String(i3/10.0) +"+ Isum="+ String(ABL_rx_Isum[wb_ix])  + "\r\n");
         ret = true;
      
       }
       catch(const std::exception& e)
       {
         ABL_rx_Isum[wb_ix] = 0;
         AsyncWebLog.println("*Exeption*");
       }   
  }
  else
  if (s.indexOf("1000140001"))
  //if (s.startsWith(">011000140001DA")) // 14 = set Imax OK (duty cycle)
  {
    // >011000140001DA
    AsyncWebLog.println("*RX Set-Imax OK*");
    ABL_tx_status[wb_ix] = POLL_Current;  // next Command
    forcePolling();
  }
  //else
  //if (s.startsWith(">01"))
  //{
  //   AsyncWebLog.println("*RX-UNKNOWN!:" + s);
  //}
  else
  {
    AsyncWebLog.println("*RX-UNVALID!");
    ABL_rx_status[wb_ix] = ABL_STATUS_STRING[ABL_UNVALID];
  }

  ABL_rx_String = "";
  return ret;
 }



void serialEventABL() 
{
    while (Serial_ABL.available()) 
    {
     char inChar = (char)Serial_ABL.read();
     ABL_rx_String += inChar;
     debug_print(inChar);
     if (inChar == '\n') 
     {
      //debug_printf("RX:%s\r\n",ABL_rx_String.c_str());
      AsyncWebLog.println("RX"+ ABL_rx_String);
      if (ABL_ParseReceive(ABL_rx_String))
      {
        if (ABL_rx_String.startsWith("01",1))
         {ABL_rx_timeoutcount[0] = 0;}
        else if (ABL_rx_String.startsWith("02",1))
         {ABL_rx_timeoutcount[1] = 0;}
      }
      ABL_rx_String = "";
      //delay(1000);
      //setLED(0); // LED off
    }
   } // while
}

#ifdef USE_ETH_INSTEAD_WIFI
//////////////////////////////////////////
/// @brief Init Ethernet
/////////////////////////////////////////
void initEthernet()
{
    debug_print("Starting ETH interface...");
    ETH.begin();
    delay(200);
    ETH.setHostname(varStore.varDEVICE_s_Name.c_str());

    debug_print("ETH MAC: ");
    debug_print(ETH.macAddress());
    debug_print("IP Address: ");
    debug_print(ETH.localIP());
    SYS_IP = ETH.localIP().toString();
    return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void handleEthernetConnection() 
{
}
#endif // USE_ETH_INSTEAD_WIFI

//////////////////////////////////////////
/// @brief Init Wifi
/////////////////////////////////////////

void initWifi(bool bSetAP)
{
  // Test mit AP !!!!!!!!!!!!!!!!!!!!!
  //varStore.varWIFI_s_Mode="AP";
  // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  // API Info: https://docs.espressif.com/projects/esp-idf/en/v4.4.6/esp32/api-reference/network/esp_wifi.html 
   if (bSetAP || (varStore.varWIFI_s_Mode == "AP"))
   {
    debug_println("WIFI:AP-Mode");
    varStore.varWIFI_s_Mode = "AP";
    WiFi.softAP("ESP_ABL_AP");   
    debug_print("IP Address: ");
    SYS_IP = WiFi.softAPIP().toString();
    debug_println(SYS_IP);
   }
   else
   {
    debug_println("WIFI:STA-Mode\r\n");
    WiFi.mode(WIFI_STA);
  
    if (varStore.varWIFI_s_SSID.length() < 2)
    {
      varStore.varWIFI_s_SSID = "noSSID";
    }
    WiFi.setHostname(varStore.varDEVICE_s_Name.c_str());
  
    wl_status_t wifiStatus;
    wifiStatus = WiFi.begin(varStore.varWIFI_s_SSID.c_str(), varStore.varWIFI_s_Password.c_str());
    delay(500);
    int i = 0;
    Serial.printf("SSID:%s\r\n", varStore.varWIFI_s_SSID);
    ///debug_printf("Passwort:%s\r\n", varStore.varWIFI_s_Password);
    while ((WiFi.waitForConnectResult() != WL_CONNECTED) && (i < 20))
    {
        Serial.print(".");
        setLED(i%2);
        i++;  
        delay(300);
    }
    if (WiFi.waitForConnectResult() == WL_CONNECTED)
    {
      Serial.printf("Get WiFi-Power:%d\r\n",WiFi.getTxPower());
      Serial.printf("Get WiFi-RSSI:%d\r\n",WiFi.RSSI());
      
      Serial.printf("IP Address: ");
      SYS_IP = WiFi.localIP().toString();
      Serial.println(SYS_IP);
      return;
    }
    else
    {
      WiFi.disconnect(false, true);
      debug_printf("\r\n*** no valid login to:%s ***\r\n", varStore.varWIFI_s_SSID.c_str());
      debug_printf("*** connect to local AP:'ESP_ABL_AP' IP: 192.168.4.1 ***\r\n")
      varStore.varWIFI_s_Mode = "AP";
      WiFi.mode(WIFI_AP);
      WiFi.softAP("ESP_ABL_AP", NULL, 6, 0, 4,false);
      debug_print("IP Address: ");
      SYS_IP = WiFi.softAPIP().toString();
      debug_println(SYS_IP);
      return;
    }
   }

  return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void handleWifiConnection() 
{
    if (varStore.varWIFI_s_Mode == "STA")
    {debug_printf("WiFi Mode:STA IP:%s\r\n", WiFi.localIP().toString());}
    else
    {debug_printf("WiFi Mode:AP IP:%s\r\n", WiFi.softAPIP().toString());}
    // Test if wifi is lost from router
    if ((varStore.varWIFI_s_Mode == "STA") && (WiFi.status() != WL_CONNECTED))
    {
        delay(200);
        if (WiFi.reconnect()==false)
        {
          saveHistory();
          WiFi.reconnect();
          Serial.println("*** RESTART ***");
          hist.putInt("restart",SYS_RestartCount++);
          delay(1000);
          ESP.restart();
        }
       
