raibisch/ESP32_ABL/src/main.cpp
    }
}

static String readString(File s) 
{
  String ret;
  int c = s.read();
  while (c >= 0) {
    ret += (char)c;
    c = s.read();
  }
  return ret;
}

int getIntStatus(uint_fast16_t wb_ix)
{
   long intValue = strtol(ABL_rx_status[wb_ix].c_str(), NULL, 16);
   return intValue;
}


// -------------------- WEBSERVER ----------------------------------------------
// -----------------------------------------------------------------------------
//


/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String setHtmlVar(const String& var)
{
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!SPIFFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = SPIFFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }
    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID02")
  {
    return varStore.varDEVICE_s_Name02;
  }
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  else
  if (var== "I-HIGH")
  {
    return "I-HIGH(" + String(varStore.varABL_i_A_soll_high) + "A)";
  }
  else
  if (var== "I-LOW")
  {
    return "I-LOW(" + String(varStore.varABL_i_A_soll_low) + "A)";
  }
  else
  if (var == "KWHSUM")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt[0] > 0)
    {
      f = ABL_Wh_Sum_akt[0] / 1000.00;
    }
    return String(f);
  } 
   if (var == "KWHSUM02")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt[1] > 0)
    {
      f = ABL_Wh_Sum_akt[1] / 1000.00;
    }
    return String(f);
  } 
  else
  if (var == "INFO")
  {
#ifndef WITHOUT_TEMP
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor.dac_offset = TSENS_DAC_L2;  // TSENS_DAC_L2 is default; L4(-40°C ~ 20°C), L2(-10°C ~ 80°C), L1(20°C ~ 100°C), L0(50°C ~ 125°C)
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    float temp_celsius = 0;
    temp_sensor_read_celsius(&temp_celsius);
    String temp = String(temp_celsius);
#else
    String temp = "(unknown)";
#endif // WITHOUT_TEMP
  
     return   "Version     :"   + SYS_Version + 
            "\nBuild       :" + SYS_CompileTime + 
            "\nPlatform    :" + ESP.getChipModel() +
            "\nTemp(C)     :" + temp +
            "\nIP-Addr     :" + SYS_IP +
            "\nRestart-Cnt :" + SYS_RestartCount + 
            "\nRSSI        :" + String(WiFi.RSSI()) + 
            
            "\nLoadBal-Mode:" + String(varStore.varABL_i_LoadBal_Mode) +
            "\nLoadBal-Isum:" + String(varStore.varABL_i_LoadBal_Imax) +
            "\nPhase-Count :" + String(varStore.varABL_i_PhaseCount) + 
            
            "\nTimeoutCnt01:" + ABL_rx_timeoutcount[0] +
            "\nTimeoutCnt02:" + ABL_rx_timeoutcount[1] + 
            "\nChargeCnt01 :" + SYS_ChargeCount[0] + 
            "\nChargeCnt02 :" + SYS_ChargeCount[1] + 
  
            "\nIpwm01      :" + String(ABL_rx_Ipwm[0]) + 
            "\nIpwm02      :" + String(ABL_rx_Ipwm[1]) + 
            "\nStatus1     :" + ABL_rx_status[0] +
            "\nStatus2     :" + ABL_rx_status[1];
  }
  else
  if (var == "IMAX")
  {
     return String(ABL_tx_Icmax[0]);
  }
  else
  if (var == "IMAX2")
  {
     return String(ABL_tx_Icmax[1]);
  }
     
  return String();
}

void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// for "/" and "/index" handle post
void Handle_Index_Post(AsyncWebServerRequest *request)
{
   debug_println("Argument: " + request->argName(0));
   debug_println("Value: ");
   uint8_t wb_ix_local = 0;
   //String s  = request->arg(i);
   //debug_println(s);
   //String sRet = "";
   if (request->argName(0) == "ihigh")
   {
     //ABL_Send("high");
     //ABL_tx_Icmax[0] = varStore.varABL_i_A_soll_high;
     setIcmax(0, varStore.varABL_i_A_soll_high);
     ABL_tx_status[0] = SET_Current;

     AsyncWebLog.println("SET-Current WB1:" + String(ABL_tx_Icmax[0]) + "A");
   }
   else
   if (request->argName(0) == "ilow")
   {
       //sRet = ABL_Send("low");
       //ABL_tx_Icmax[0] = varStore.varABL_i_A_soll_low;
       setIcmax(0, varStore.varABL_i_A_soll_low);
       ABL_tx_status[0] = SET_Current;
       AsyncWebLog.println("SET-Current WB1:" + String(ABL_tx_Icmax[0]) + "A");
   }
   else
   if (request->argName(0) == "pause")
   {
       //sRet = ABL_Send("low");
       //ABL_tx_Icmax[0] = 0;
       setIcmax(0, 0);
       ABL_tx_status[0] = SET_Current;
      
       AsyncWebLog.println("CHARGE-PAUSE WB1");
    }

  // 2. Wallbox
   if (request->argName(0) == "ihigh2")
   {
     //ABL_Send("high");
     wb_ix_local = 1;
     //ABL_tx_Icmax[1] = varStore.varABL_i_A_soll_high;
     setIcmax(1, varStore.varABL_i_A_soll_high);
     ABL_tx_status[1] = SET_Current;
     AsyncWebLog.println("SET-Current WB2:" + String(ABL_tx_Icmax[1]) + "A");
   }
   else
   if (request->argName(0) == "ilow2")
   {
       //sRet = ABL_Send("low");
       wb_ix_local = 1;
       //ABL_tx_Icmax[1] = (int)varStore.varABL_i_A_soll_low;
       setIcmax(1, varStore.varABL_i_A_soll_low);
       ABL_tx_status[1] = SET_Current;
      AsyncWebLog.println("SET-Current WB2:" + String(ABL_tx_Icmax[1]) + "A");
   }
   else
   if (request->argName(0) == "pause2")
   {
       //sRet = ABL_Send("low");
       wb_ix_local = 1;
       //ABL_tx_Icmax[1] = 0;
       setIcmax(1, 0);
       ABL_tx_status[1] = SET_Current;
       AsyncWebLog.println("CHARGE-PAUSE WB2");
    }
   
   if (wb_ix_local == 0)
   { 
#if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
   }
   else
   {
    request->send(SPIFFS, "/index2.html", String(), false, setHtmlVar);
   }
}

void initWebServer()
{ 
  debug_print("Init web server...\n");
    //Route for root / web page
  server.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    if (bInitFileOK) 
    { 
#if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
    }
    else
    { // "rescue page" for first run without valid Wifi-credentials or no valid data-system
      request->redirect("/ota_ap.html");
      //request->send(202, "text/plain", "goto: http://192.168.4.1/ota_ap.html");
    }
  });

   
  // Notfall Website 'ota_ap.html' für Software-Upload
  static const char* staticOTA_site PROGMEM = R"(
<!DOCTYPE HTML><html lang="de"><head>
<title>OTA-Update</title><meta charset="UTF-8"></head>
<body><form method='POST' action='/ota_update' enctype='multipart/form-data'></p><div>Select a file 'myFS.bin' (myFS-Data) or 'firmware.bin' (Program)</div><input class='container' type='file' name='update' accept='.bin'><input type='submit' name="startupdate" value='START-UPLOAD'><BR></form>
</p><a class="buttonlink" href="reboot.html">REBOOT!</a>
</body></html>
)";
  server.on("/ota_ap.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(200, "text/html", staticOTA_site);
  });


