raibisch/ESP32_ABL/src/main.cpp
  //Route for root /index web page
  server.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   #if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
  });

  
  //Route for root /index web page
  server.on("/index2.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index2.html", String(), false, setHtmlVar);
  });


  // > Version V1.2
  //Route for stored values
  server.on("/setcurrent.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setcurrent.html", String(), false, setHtmlVar);
  });

  server.on("/setcurrent2.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setcurrent2.html", String(), false, setHtmlVar);
  });
  
  //Route for setup web page
  server.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setup.html", String(), false, setHtmlVar);
  });


  //Route for config web page
  server.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });

  
  //Route for stored values
  server.on("/setvalues.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });

  // > Version V1.2
  //Route for Info-page
  server.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/info.html", String(), false, setHtmlVar);
  });
  

  // Route for style-sheet
  server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/style.css", String(), false);
  });


  // fetch GET
  server.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    
    // fetch is also used for setting Imax with URL-Variable
    // example: 
    // http://<your-ip>/fetch?imax=8 --> set Imax to 8A
    //
    // valid values: imax=0..6..8..10..12..14..15..16 
    // specal case imax=0 --> Pause charging
    if (request->args() > 0)
    {
    debug_println("GET-Argument: " + request->argName(0));
    debug_print("Value: ");
    uint8_t i = 0;
    String s  = request->arg(i);
    debug_println(s);
    if (request->argName(0) == "imax")
    {
       uint a = String(request->arg(i)).toInt();
       AsyncWebLog.println("GET-SET-Imax WB1:" + String(a)+ "A");
       if ((a >=6 && a <=16) || (a==0))
       {
           //ABL_tx_Icmax[0] = a;
           setIcmax(0,a);
           ABL_tx_status[0] = SET_Current; // next Send Protocol
       }
       else
       {
        AsyncWebLog.println("**ERROR Imax WB01 out of range!");
       }
    }
    }
    
    String sStatus;
    if (ABL_PauseFlag[0])
    {
      sStatus = ABL_STATUS_STRING[ABL_PAUSE];
    }
    sStatus += ABL_rx_status[0];
    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = String(ABL_rx_Ipwm[0])+',' + String(ABL_rx_kW[0]) + ','+ sStatus+ ',' + String(ABL_rx_Wh[0]/1000.0) + ',' + String(ABL_Wh_Sum_akt[0]) + ',' +String(ABL_sChargeTime[0]);
    request->send(200, "text/plain", s);
    //debug_println("server.on /fetch: "+ s);
  });

  // fetch GET
  server.on("/fetch2", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    
    // fetch is also used for setting Imax with URL-Variable
    // example: 
    // http://<your-ip>/fetch?imax=8 --> set Imax to 8A
    //
    // valid values: imax=0 6 7 8 9 10 11 12 13 14 15 16 
    // specal case imax=0 --> Pause charging
    if (request->args() > 0)
    {
    debug_println("GET-Argument: " + request->argName(0));
    debug_print("Value: ");
    uint8_t i = 0;
    String s  = request->arg(i);
    debug_println(s);
    if (request->argName(0) == "imax")
    {
       uint a = String(request->arg(i)).toInt();
       AsyncWebLog.println("GET-SET-Imax WB2:" + String(a)+ "A");
       if ((a >=6 && a <=16) || (a==0))
       {
           //ABL_tx_Icmax[1] = a;
           setIcmax(1,a);
           ABL_tx_status[1] = SET_Current; // next Send Protocol
       }
       else
       {
        AsyncWebLog.println("**ERROR Imax WB02 out of range!");
       }
    }
    }
    
    String sStatus;
    if (ABL_PauseFlag[1])
    {
      sStatus = ABL_STATUS_STRING[ABL_PAUSE];
    }
    sStatus += ABL_rx_status[1];
    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = String(ABL_rx_Ipwm[1])+',' + String(ABL_rx_kW[1]) + ','+ sStatus + ',' + String((ABL_rx_Wh[1])/1000.0) + ',' + String(ABL_Wh_Sum_akt[1]) + ',' +String(ABL_sChargeTime[1]);
    debug_println("server.on /fetch2: "+ s);
    request->send(200, "text/plain", s);
  });
 
  // fetch GET
  server.on("/fetchjson", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    // z.Z. nur für Wallbox-01
    const uint_fast16_t wb_ix = 0;
    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = "{\"ipwm\": "      + String(ABL_rx_Ipwm[wb_ix])+ ", "+ 
                 "\"kw\": "       + String(ABL_rx_kW[wb_ix])  + ", "+ 
                 "\"status\": \"" + ABL_rx_status[wb_ix]     + "\", "+ 
                 "\"wh\": "       + String(ABL_rx_Wh[wb_ix]/1000.0) + ", " + 
                 "\"whsum\": "    + String(ABL_Wh_Sum_akt[wb_ix])   + ", " + 
                 "\"ctime\": \""  + String(ABL_sChargeTime[wb_ix]) + "\"}\r\n";
    request->send(200, "text/json", s);
    //debug_println("server.on /fetch: "+ s);
  });

  // fetch GET
  server.on("/fetchkv", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    // z.Z. nur für Wallbox-01
    const uint_fast16_t wb_ix = 0;
    String s = "Imax=" + String(ABL_rx_Ipwm[0]) + " A \n" + 
               "ActPower=" + String(ABL_rx_kW[0]) + " kW\n" +
               "Status=" + String(ABL_rx_status[0]) + "\n" +
               "IntStatus=" + String(getIntStatus(0)) + "\n" +
               "ActWork=" + String((ABL_rx_Wh[0])/1000.0) + " kW/h\n" +
               "SumWork=" + String(ABL_Wh_Sum_akt[0]) + " W/h\n" +
               "ChargeTime=" + String(ABL_sChargeTime[0]) + "\n";
    request->send(200, "text/plain", s);
  });

