raibisch/ESP32_ABL/src/main.cpp
  server.onNotFound(notFound);

  AsyncWebLog.begin(&server);
  AsyncWebOTA.begin(&server);
  server.begin();
}


void initSPIFFS()
{
  if (!SPIFFS.begin())
  {
   debug_println("*** ERROR: SPIFFS Mount failed");
  } 
  else
  {
   debug_println("* INFO: SPIFFS Mount succesfull");
  }
}


// ------------------((ABL_rx_status.startsWith("C")) && --------------------------
void setup()
{
  delay(1000);
  Serial.begin(115200);
  delay(800);
  Serial.println("*** ABL: Setup-Start ***");
  initSPIFFS();
#ifndef WITHOUT_LED
  initLED();
#endif
  bInitFileOK = initFileVarStore();
  initHistory();
#ifdef USE_ETH_INSTEAD_WIFI
  initEthernet();
#else
  initWifi(!bInitFileOK);
#endif
  delay(200);
#ifdef MQTT_ENABLE
  mqtt_setup();
#endif  
  initWebServer();
  ABL_init();
 
  rtc[0].setTime(0);
  rtc[1].setTime(0);
  Serial.println("*** ABL Setup End ***");
}


void loop()
{
    static uint_fast16_t last_wb_poll_ix = 0;
    static String s;
    static int iBlink;


    for (size_t i = 0; i < WB_COUNT; i++)
    { 
       if (forcePollFlag[i])
       {
          tmp_poll_time_ms = 0;      // fast polling after change of current
          //AsyncWebLog.println("Set Poll-Time:1");
       }
       else if (ABL_rx_status[i].startsWith("C"))
       { tmp_poll_time_ms = 5000;}  // while charging 5sec polling.
       else
       { tmp_poll_time_ms = varStore.varABL_i_Scantime_ms;} // value > 30sec reduces standby power 
    }
    
    if (millis() > (ABL_PollTime_old + tmp_poll_time_ms))
    {
      String slog = "Poll-Time:" + String(tmp_poll_time_ms);
      AsyncWebLog.println(slog);
  #if WB_COUNT == 2
      if (last_wb_poll_ix >= WB_COUNT-1)
      {last_wb_poll_ix = 0;}
      else
      {last_wb_poll_ix++;}
  #else
      last_wb_poll_ix = 0;
  #endif

      forcePollFlag[last_wb_poll_ix] = false;
      ABL_PollTime_old  = millis();
      log_timer = tmp_poll_time_ms / 1000;
      ABL_Send(last_wb_poll_ix,ABL_tx_status[last_wb_poll_ix]);
      testTimeount(last_wb_poll_ix); 
    }

    serialEventABL();

    if (millis() - varStore.varABL_i_logtime_ms > ABL_StatusSec_old)
    { 
      //calculate_kWh(last_wb_poll_ix);
      setLED(iBlink%2);
      iBlink++;
      ABL_StatusSec_old = millis();

      for (size_t i = 0; i < WB_COUNT; i++)
      {
        calculate_kWh(i);
      }

      if (log_timer > 0)
      {log_timer--;}
      else
      {log_timer = tmp_poll_time_ms / 1000;}
    
      s = "[Poll  ]WB"+ String(last_wb_poll_ix+1) + " next Tx sec:" + String(log_timer);
      AsyncWebLog.println(s);
      debug_println(s);

#ifdef USE_ETH_INSTEAD_WIFI
      handleEthernetConnection();
#else
      handleWifiConnection();
#endif
    }
#ifdef MQTT_ENABLE
    mqtt_loop();
#endif  
   delay(1);            
}

